Revit 2027 API
BuiltInFailures.RebarFailures.CannotSolveRebarWithDelayedConstraints Property
 There are rebar handles with invalid selected targets to constrain. The bar preview corresponds to latest valid constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSolveRebarWithDelayedConstraints { get; }
Public Shared ReadOnly Property CannotSolveRebarWithDelayedConstraints As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSolveRebarWithDelayedConstraints {
	FailureDefinitionId^ get ();
}
static member CannotSolveRebarWithDelayedConstraints : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace